import React from 'react';
import ExamplePhrase from '../../ExamplePhrase';

const MinistryOfDefense = () => {
    return (
        <>
            <div className="subsection">
                <h3>📡 Доклады для нарядов</h3>

                <div className="note">
                    <h4><strong>Патруль территории</strong></h4>
                    <ExamplePhrase text="r [ТЕГ] [Патруль территории] Докладывает: Звание Фамилия. Приступаю к патрулированию территории. Код - #." />
                    <ExamplePhrase text="r [ТЕГ] [Патруль территории] Докладывает: Звание Фамилия. Завершил патрулирование территории. Код - #." />
                    <div className="note">
                        <strong>📌 Пример:</strong> [УБ] [Патруль территории] Докладывает: Рядовой Гуд. Приступаю к патрулированию территории. Код - 1.
                    </div>
                </div>

                <div className="note">
                    <h4><strong>Часовой на вышке</strong></h4>
                    <ExamplePhrase text="r [ТЕГ] [Вышка-1/2/3/4] Докладывает: Звание Фамилия. Приступил к дежурству на Вышке. Код - #." />
                    <ExamplePhrase text="r [ТЕГ] [Вышка-1/2/3/4] Докладывает: Звание Фамилия. Завершил дежурство на Вышке. Код - #." />
                    <ExamplePhrase text="r [ТЕГ] Докладывает: Звание Фамилия. Запрашиваю разрешение в наряд Часовой на вышке. Код - #." />
                    <div className="note">
                        <strong>📌 Пример:</strong> [УБ] [Вышка-1] Докладывает: Ефрейтор Гуд. Завершил дежурство на Вышке. Код - 1.
                    </div>
                </div>

                <div className="note">
                    <h4><strong>Охрана пропускного пункта (КПП)</strong></h4>
                    <ExamplePhrase text="r [ТЕГ] [КПП] Докладывает: Звание Фамилия. Приступил к дежурству на КПП. Код - #." />
                    <ExamplePhrase text="r [ТЕГ] [КПП] Докладывает: Звание Фамилия. Завершил дежурство на КПП. Код - #." />
                    <div className="note">
                        <strong>📌 Пример:</strong> [УБ] [КПП] Докладывает: Мл. Сержант Гуд. Завершил дежурство на КПП. Код - 1.
                    </div>
                </div>

                <div className="note">
                    <h4><strong>Тен-коды</strong></h4>
                    <ul className="list-disc pl-5">
                        <li>Код-1: Обстановка спокойная.</li>
                        <li>Код-2: Общая боевая тревога в части!</li>
                        <li>Код-3: Требуется подмога!</li>
                        <li>Код-4: Заступил на службу (Для контрактной службы во время захода в игру).</li>
                        <li>Код-5: Окончил службу и сдал форму (Для контрактной службы при выходе из игры).</li>
                        <li>Код-6: Всеобщее построение на плацу!</li>
                        <li>Код-7: Проникновение на территорию Воинской Части!</li>
                        <li>Код-8: Цель ликвидирована!</li>
                        <li>Код-9: Покинул место несения службы (Для контрактной службы при взятии перерыва/окончания РД).</li>
                        <li>Код-10: Вернулся на место несения службы (Для контрактной службы при окончания перерыва/начала РД).</li>
                    </ul>
                    <div className="note">
                        <strong>📌 Примеры:</strong>
                        <ExamplePhrase text="r [К.ЦПОС] Прапорщик Гуд. Код-4." />
                        <ExamplePhrase text="r [И.ВАИ] Капитан Гуд. Код-9." />
                        <ExamplePhrase text="r [УБ] [КПП] Ст.Лейтенант Гуд. Код-3!" />
                        <ExamplePhrase text="r [О.ГНР] [Патруль территории] Лейтенант Гуд. Код-7!" />
                    </div>
                </div>
            </div>
        </>
    );
};

export default MinistryOfDefense;
